import { type InventoryAlertRule } from "../types/inventory-alert-rule";

export const inventoryAlertRules: InventoryAlertRule[] = [
    {
        name: "Кава/Кава",
        threshold: 2000,
        unit: "г",
        message: "Потрібно поповнити запас. Залишилось приблизно 2 кг.",
    },
    {
        name: "Молоко/Молоко",
        threshold: 43200,
        unit: "г",
        message: "Потрібно поповнити запас. Залишилось приблизно 48 одиниць по 900 г.",
    },
    {
        name: "Молоко/Молоко (без лакт.)",
        threshold: 12000,
        unit: "г",
        message: "Потрібно поповнити запас. Залишилось приблизно 12 одиниць по 1000 г.",
    },
    {
        name: "Молоко/Молоко (росл.)",
        threshold: 12000,
        unit: "мл",
        message: "Потрібно поповнити запас. Залишилось приблизно 12 одиниць по 1000 мл.",
    },
    {
        name: "Стакан 110",
        threshold: 100,
        unit: "шт.",
        message: "Потрібно поповнити запас. Залишилось приблизно 100 шт.",
    },
    {
        name: "Стакан 270",
        threshold: 150,
        unit: "шт.",
        message: "Потрібно поповнити запас. Залишилось приблизно 150 шт.",
    },
    {
        name: "Стакан 175 (для води)",
        threshold: 50,
        unit: "шт.",
        message: "Потрібно поповнити запас. Залишилось приблизно 50 шт.",
    },
    {
        name: "Стакан 185",
        threshold: 100,
        unit: "шт.",
        message: "Потрібно поповнити запас. Залишилось приблизно 100 шт.",
    },
    {
        name: "Стакан 400",
        threshold: 200,
        unit: "шт.",
        message: "Потрібно поповнити запас. Залишилось приблизно 200 шт.",
    },
];
